In [1]:
import sklearn as sk
import pandas as pd
import numpy as np
from sklearn.neighbors import KNeighborsClassifier
from sklearn.linear_model import LogisticRegression
from sklearn import preprocessing
from sklearn.preprocessing import StandardScaler

# Reading .csv

In [2]:
data=pd.read_csv('./train.csv')
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
#data_train=data[0:600]
#data_test=data[600:]

In [4]:
#data_train

In [5]:
#data_test

In [6]:
#data.columns

# string -> int encoding

In [7]:
data_dropped=data.drop(['PassengerId' ,'Name', 'Ticket',  'Cabin'],axis=1)
data_dropped.loc[data_dropped.Sex=='male','Sex']=1
data_dropped.loc[data_dropped.Sex=='female','Sex']=0
data_dropped.loc[data_dropped.Embarked=='S','Embarked']=0
data_dropped.loc[data_dropped.Embarked=='Q','Embarked']=1
data_dropped.loc[data_dropped.Embarked=='C','Embarked']=2




data_dropped

     Survived  Pclass Sex   Age  SibSp  Parch     Fare Embarked
0           0       3   1  22.0      1      0   7.2500        0
1           1       1   0  38.0      1      0  71.2833        2
2           1       3   0  26.0      0      0   7.9250        0
3           1       1   0  35.0      1      0  53.1000        0
4           0       3   1  35.0      0      0   8.0500        0
..        ...     ...  ..   ...    ...    ...      ...      ...
886         0       2   1  27.0      0      0  13.0000        0
887         1       1   0  19.0      0      0  30.0000        0
888         0       3   0   NaN      1      2  23.4500        0
889         1       1   1  26.0      0      0  30.0000        2
890         0       3   1  32.0      0      0   7.7500        1

[891 rows x 8 columns]

In [161]:
dt_drop=data_dropped
dt_train=dt_drop[:600]
dt_test=dt_drop[600:]

In [162]:
dt_train=dt_train.dropna(axis=0)
dt_test=dt_test.dropna(axis=0)

In [163]:
X_train=dt_train.loc[:,['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked']]
Y_train=dt_train.loc[:,['Survived']]

X_test=dt_test.loc[:,['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked']]
Y_test=dt_test.loc[:,['Survived']]

In [164]:
_max=X_train.loc[:,['Fare']].max()

_min=X_train.loc[:,['Fare']].min()
m=_max-_min


#Z score normalization
for col in X_train.columns:
    _std=X_train.loc[:,[col]].std()
    _mean=X_train.loc[:,[col]].mean()
    
    X_train.loc[:,[col]]=(X_train.loc[:,[col]]-_mean)/_std
    #X_train.loc[:,['Age']]/=50
    X_test.loc[:,[col]]=(X_test.loc[:,[col]]-_mean)/_std
    #X_test.loc[:,['Age']]/=50

Pclass
Sex
Age
SibSp
Parch
Fare
Embarked

In [ ]:
df=X_train
x = df.values #returns a numpy array
min_max_scaler = preprocessing.StandardScaler()
x_scaled = min_max_scaler.fit_transform(x)
df = pd.DataFrame(data=x_scaled,columns=['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked'])
X_train=df

In [ ]:
df=X_test
x = df.values #returns a numpy array
min_max_scaler = preprocessing.StandardScaler()
x_scaled = min_max_scaler.fit_transform(x)
df = pd.DataFrame(data=x_scaled,columns=['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked'])
X_test=df

# Data Normalizing

In [165]:
X_train

       Pclass       Sex       Age     SibSp     Parch      Fare  Embarked
0    0.917740  0.779459 -0.533861  0.479799 -0.523786 -0.554474 -0.522135
1   -1.467375 -1.280229  0.566128  0.479799 -0.523786  0.764109  2.037139
2    0.917740 -1.280229 -0.258864 -0.561232 -0.523786 -0.540575 -0.522135
3   -1.467375 -1.280229  0.359880  0.479799 -0.523786  0.389676 -0.522135
4    0.917740  0.779459  0.359880 -0.561232 -0.523786 -0.538001 -0.522135
..        ...       ...       ...       ...       ...       ...       ...
592  0.917740  0.779459  1.184871 -0.561232 -0.523786 -0.554474 -0.522135
594 -0.274818  0.779459  0.497378  0.479799 -0.523786 -0.168371 -0.522135
595  0.917740  0.779459  0.428629  0.479799  0.690678 -0.206467 -0.522135
597  0.917740  0.779459  1.322370 -0.561232 -0.523786 -0.703767 -0.522135
599 -1.467375  0.779459  1.322370  0.479799 -0.523786  0.468527  2.037139

[473 rows x 7 columns]

In [29]:
Y_train

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
592         0
594         0
595         0
597         0
599         1

[473 rows x 1 columns]

# RESULT

In [203]:
LRmodel=sk.linear_model.LogisticRegression(max_iter=20)
LRmodel.fit(X_train,Y_train.values.ravel())

LogisticRegression(max_iter=20)

1. min-max 정규화는 max-iter 25 미만 에서 작동하지 않음. 그 이상에서는 잘 작동.

In [204]:
LRmodel.score(X_test,Y_test.values.ravel())

0.8158995815899581

In [205]:
Y_pred=LRmodel.predict(X_test)
#print(Y_pred)
#print(Y_test.values.ravel())
ret=sk.metrics.accuracy_score(Y_test.values.ravel(),Y_pred)
F1=sk.metrics.f1_score(Y_test.values.ravel(),Y_pred)

In [206]:
ret

0.8158995815899581

In [207]:
F1

0.7500000000000001